Revit 2024 API
Document.GetCloudModelUrn Method
 A ForgeDM Urn identifying the model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public string GetCloudModelUrn()
Visual Basic
Public Function GetCloudModelUrn As String
Visual C++
public:
String^ GetCloudModelUrn()
Remarks
 It is empty for non-cloud model; It is cached in Revit model opened session after getting it;
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.RevitServerUnauthorizedException |  Thrown when cannot get data from ForgeDM.
See Also
Document Class
Autodesk.Revit.DB Namespace